{
    "Cast": {
        "EdgeDisableDialProtocolForCastDiscovery": {
            "type": "boolean",
            "description": "Disable DIAL protocol for cast device discovery",
            "GPO": {
                "type": "boolean",
                "path": "Computer Configuration\\Administrative Templates\\Microsoft Edge\\Cast\\EdgeDisableDialProtocolForCastDiscovery"
            },
            "Registry": {
                "type": "REG_DWORD",
                "path": "HKEY_LOCAL_MACHINE\\SOFTWARE\\Policies\\Microsoft\\Edge\\EdgeDisableDialProtocolForCastDiscovery"
            },
            "requirements": "Microsoft Edge version 121",
            "description-detailed": "Enable this policy to disable the DIAL (Discovery And Launch) protocol for cast device discovery. (If EnableMediaRouter is disabled, this policy will have no effect).\n\nEnable this policy to disable DIAL protocol.\nBy default, Cast device discovery will use DIAL protocol."
        },
        "EnableMediaRouter": {
            "type": "boolean",
            "description": "Enable Google Cast",
            "GPO": {
                "type": "boolean",
                "path": "Computer Configuration\\Administrative Templates\\Microsoft Edge\\Cast\\EnableMediaRouter"
            },
            "Registry": {
                "type": "REG_DWORD",
                "path": "HKEY_LOCAL_MACHINE\\SOFTWARE\\Policies\\Microsoft\\Edge\\EnableMediaRouter"
            },
            "requirements": "Microsoft Edge version 77",
            "description-detailed": "Enable this policy to enable Google Cast. Users will be able to launch it from the app menu, page context menus, media controls on Cast-enabled websites, and (if shown) the Cast toolbar icon.\n\nDisable this policy to disable Google Cast.\nBy default, Google Cast is enabled."
        },
        "ShowCastIconInToolbar": {
            "type": "boolean",
            "description": "Show the cast icon in the toolbar",
            "GPO": {
                "type": "boolean",
                "path": "Computer Configuration\\Administrative Templates\\Microsoft Edge\\Cast\\ShowCastIconInToolbar"
            },
            "Registry": {
                "type": "REG_DWORD",
                "path": "HKEY_LOCAL_MACHINE\\SOFTWARE\\Policies\\Microsoft\\Edge\\ShowCastIconInToolbar"
            },
            "requirements": "Microsoft Edge version 77",
            "description-detailed": "Set this policy to true to show the Cast toolbar icon on the toolbar or the overflow menu. Users won't be able to remove it.\n\nIf you don't configure this policy or if you disable it, users can pin or remove the icon by using its contextual menu.\n\nIf you've also set the 'EnableMediaRouter' (Enable Google Cast) policy to false, then this policy is ignored, and the toolbar icon isn't shown."
        }
    }
}
